<a href="https://colab.research.google.com/github/gudiya-archi/Data-science/blob/main/pandas1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [ ]:
# series from lists

# string
country = ['india','pakistan','USA','Nepal','Srilanka']
pd.Series(country)

0       india
1    pakistan
2         USA
3       Nepal
4    Srilanka
dtype: object

In [ ]:
# integers
runs = [13,24,56,78,100]
pd.Series(runs)

0     13
1     24
2     56
3     78
4    100
dtype: int64

In [ ]:
# custom index
marks = [67,57,89,100]
subjects = ['maths','english','science','hindi']

pd.Series(marks,index=subjects)

maths       67
english     57
science     89
hindi      100
dtype: int64

In [ ]:
# setting a name
marks = pd.Series(marks,index=subjects,name='Nitish ke marks')
marks

maths       67
english     57
science     89
hindi      100
Name: Nitish ke marks, dtype: int64

In [ ]:
# series from dict
marks ={
    'maths':67,
    'english':57,
    'science':89,
    'hindi':100
}

marks_series = pd.Series(marks, name='Nitish ke marks')
marks_series

maths       67
english     57
science     89
hindi      100
Name: Nitish ke marks, dtype: int64

In [ ]:
# series attributes
marks

{'maths': 67, 'english': 57, 'science': 89, 'hindi': 100}

In [ ]:
marks_series

maths       67
english     57
science     89
hindi      100
Name: Nitish ke marks, dtype: int64

In [ ]:
# size
marks_series.size

4

In [ ]:
# dtype
marks_series.dtype

dtype('int64')

In [ ]:
# name
marks_series.name

'Nitish ke marks'

In [ ]:
# is_unique
marks_series.is_unique

True

In [ ]:
import pandas as pd
marks_series.is_unique
pd.series([1,1,2,3,4,5]).is_unique

AttributeError: module 'pandas' has no attribute 'series'

In [ ]:
# index

marks_series.index

Index(['maths', 'english', 'science', 'hindi'], dtype='object')

In [ ]:
# integers
runs = [13,24,56,78,100]
runs_ser = pd.Series(runs)

In [ ]:
runs_ser.index

RangeIndex(start=0, stop=5, step=1)

In [ ]:
type(runs_ser.index)

pandas.core.indexes.range.RangeIndex

In [ ]:
# values
marks_series.values

array([ 67,  57,  89, 100])

In [ ]:
type(marks_series.values)

numpy.ndarray

Editing Series

In [ ]:
# using indexing
marks_series

maths       67
english     57
science     89
hindi      100
Name: Nitish ke marks, dtype: int64

In [ ]:
marks_series[1] = 100
marks_series

/tmp/ipython-input-23-3660931059.py:1: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  marks_series[1] = 100

maths       67
english    100
science     89
hindi      100
Name: Nitish ke marks, dtype: int64

In [ ]:
# what if an index does not exit
marks_series['sst'] = 90

In [ ]:
marks_series

maths       67
english    100
science     89
hindi      100
sst         90
Name: Nitish ke marks, dtype: int64

In [ ]:
# slicing
runs_ser

0     13
1     24
2     56
3     78
4    100
dtype: int64

In [ ]:
runs_ser[2:4] = [100,100]
runs_ser

0     13
1     24
2    100
3    100
4    100
dtype: int64

In [ ]:
# fancy indexing
runs_ser[[0,3,4]] = [0,0,0]
runs_ser

0      0
1     24
2    100
3      0
4      0
dtype: int64

In [ ]:
# type conversion --> 1
marks_series

maths       67
english    100
science     89
hindi      100
sst         90
Name: Nitish ke marks, dtype: int64

In [ ]:
# type conversion --> 2
list(marks_series)

[67, 100, 89, 100, 90]

In [ ]:
# type conversion --> 3
dict(marks_series )

{'maths': np.int64(67),
 'english': np.int64(100),
 'science': np.int64(89),
 'hindi': np.int64(100),
 'sst': np.int64(90)}

In [ ]:
# arithematic operator Boradcasting)
100 -marks_series

maths      33
english     0
science    11
hindi       0
sst        10
Name: Nitish ke marks, dtype: int64